app/controllers/deputies_controller.rb

  def all
    deputy_order = Deputy.order(:deputy_name)
---
SELECT "deputies".* FROM "deputies"  ORDER BY "deputies"."deputy_name" ASC

  def show
    deputy_id = params[:id]
    selected_deputies = Deputy.where(id: deputy_id)
---
SELECT "deputies".* FROM "deputies" WHERE "deputies"."id" = ?  [["id", 1]]

  def create
    @deputy = Deputy.new(deputy_params)
    deputy_saved = @deputy.save
---
INSERT INTO "deputies" ("deputy_name", "registration", "legislation_situation", "image_path", "uf_id", "party_id") VALUES (?, ?, ?, ?, ?, ?)  [["deputy_name", "Ila Mitchell"], ["registration", 1821], ["legislation_situation", "Titular"], ["image_path", "qualquer"], ["uf_id", 1], ["party_id", 2]]

  def update
    deputy_id = params[:id]
    deputies = Deputy.where(id: deputy_id)
    @deputy = deputies.first
    @deputy.update(deputy_params)
---
SELECT  "deputies".* FROM "deputies" WHERE "deputies"."id" = ?  ORDER BY "deputies"."id" ASC LIMIT 1  [["id", 1]]
UPDATE "deputies" SET "deputy_name" = ?, "registration" = ? WHERE "deputies"."id" = ?  [["deputy_name", "Marisa Ryan"], ["registration", 1491], ["id", 1]]

  def delete
    deputy_id = params[:id]
    selected_deputies = Deputy.where(id: deputy_id)
    if (selected_deputies.length > 0)
      @deputy = selected_deputies.first
      @deputy.destroy
---
SELECT  "deputies".* FROM "deputies" WHERE "deputies"."id" = ? LIMIT 1  [["id", 1]]
DELETE FROM "deputies" WHERE "deputies"."id" = ?  [["id", 1]]

  def followed_deputies
    user_id = params[:id]
    user = User.find_by(id: user_id)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]

  def image
    deputy_id = params[:id]
    deputy = Deputy.find_by(id: deputy_id)
---
SELECT  "deputies".* FROM "deputies" WHERE "deputies"."id" = $1 LIMIT 1  [["id", 1]]