app/controllers/users_controller.rb

INSERT INTO "users" ("nickname", "password_digest") VALUES ($1, $2) RETURNING "id"  [["nickname", "tulioco"], ["password_digest", "$2a$10$oZJkhdvRPdKLnt3djkTsNuwUuvZfV6L6sE/P50sTezVQ/QtB7wYQC"]]
---
  def create
    #puts get_params
    @user = User.new(user_params)
    saved = @user.save

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]
SELECT "quests".* FROM "quests"
---
  def receive_quests
    user_id = params[:userId]
    user = User.find_by(id: user_id)
    questsAmount = params[:questsAmount]

    if user && user.challengers.length < 3
      allQuests = []
      Quest.all.each do |quest|